Terraform Plan:

```
oci_identity_compartment.k8s: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaa4bbfmz332ypqxr6icuitp54jj7czdp4qliuo575ytuqakppgtmra]
module.virtual_network.oci_core_vcn.vcn["vcn1"]: Refreshing state... [id=ocid1.vcn.oc1.eu-frankfurt-1.amaaaaaaic6ifviaeoaecu6uwycqmey7fx557mpjsj2cq2m35l5czm66to6a]
module.virtual_network.oci_core_internet_gateway.igw["vcn1"]: Refreshing state... [id=ocid1.internetgateway.oc1.eu-frankfurt-1.aaaaaaaatkiuijvp3iqbqnkdtznubouu2tg2verx24tgajrkoh5kh4znr7sa]
module.virtual_network.oci_core_network_security_group.nsg["vcn1"]: Refreshing state... [id=ocid1.networksecuritygroup.oc1.eu-frankfurt-1.aaaaaaaa77qzf3kjaksjekmwpf7ljfaohaclwaklrzztsea4umy5usxnl4xa]
module.virtual_network.oci_core_route_table.rt["vcn1"]: Refreshing state... [id=ocid1.routetable.oc1.eu-frankfurt-1.aaaaaaaayo35y4z5ptradj66364ykxoqytm6mfnqfahiwboyevwscpq4zf3a]
module.virtual_network.oci_core_subnet.subnet["subnet1"]: Refreshing state... [id=ocid1.subnet.oc1.eu-frankfurt-1.aaaaaaaaxk5c2nrlrmqdyvj7rprsp57wmfwdvqcloexfo4omsi3soafnpfrq]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.virtual_network.oci_core_internet_gateway.igw["vcn1"] will be updated in-place
  ~ resource "oci_core_internet_gateway" "igw" {
      ~ defined_tags   = {
          - "Oracle-Tags.CreatedBy" = "default/petr.nemec@gmx.com" -> null
          - "Oracle-Tags.CreatedOn" = "2023-06-02T09:37:50.584Z" -> null
        }
        id             = "ocid1.internetgateway.oc1.eu-frankfurt-1.aaaaaaaatkiuijvp3iqbqnkdtznubouu2tg2verx24tgajrkoh5kh4znr7sa"
        # (7 unchanged attributes hidden)
    }

  # module.virtual_network.oci_core_network_security_group_security_rule.nsg_rule["rule1"] will be created
  + resource "oci_core_network_security_group_security_rule" "nsg_rule" {
      + description               = "test rule"
      + destination               = (known after apply)
      + destination_type          = (known after apply)
      + direction                 = "INGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = "ocid1.networksecuritygroup.oc1.eu-frankfurt-1.aaaaaaaa77qzf3kjaksjekmwpf7ljfaohaclwaklrzztsea4umy5usxnl4xa"
      + protocol                  = "6"
      + source                    = "10.20.30.40/32"
      + source_type               = "CIDR_BLOCK"
      + stateless                 = false
      + time_created              = (known after apply)

      + tcp_options {
          + destination_port_range {
              + max = 200
              + min = 100
            }
        }
    }

  # module.virtual_network.oci_core_route_table.rt["vcn1"] will be updated in-place
  ~ resource "oci_core_route_table" "rt" {
      ~ defined_tags   = {
          - "Oracle-Tags.CreatedBy" = "default/petr.nemec@gmx.com" -> null
          - "Oracle-Tags.CreatedOn" = "2023-06-02T09:37:51.644Z" -> null
        }
        id             = "ocid1.routetable.oc1.eu-frankfurt-1.aaaaaaaayo35y4z5ptradj66364ykxoqytm6mfnqfahiwboyevwscpq4zf3a"
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.virtual_network.oci_core_route_table.rt["vcn1"],
  on modules/virtualNetwork/virtualNetwork.tf line 36, in resource "oci_core_route_table" "rt":
  36: resource oci_core_route_table "rt" {

The 'cidr_block' field has been deprecated. Please use 'destination' instead.
```

Plan saved to GH artifacts.